---
kind: other
id: Methods.T:Autodesk.Revit.DB.RadialArray
source: html/0249fbe7-0254-9fac-0c2e-f7d8c6ece330.htm
---
# RadialArray Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.